
# 원문 데이터 가져오기
textData = readRDS(file = "./raw_data/petitions_content_2018.RDS")
categoryData = readRDS(file = "./raw_data/petitions_category_name_2018.RDS")

#문제1) 각 데이터에 어떤 컬럼이 있는지 확인


#문제2) 각 데이터의 컬럼 정보 확인


#문제3) 각 데이터의 row개수 구하기


#문제4) 원문과 문서 카테고리 데이터 Join하기


#문제5) 일별 문서개수 구하고, Line차트로 일별 추이 구하기


#문제6) 카테고리별 문서개수 구하고, Bar차트로 그리기


#문제7) 동의수가 높은순으로 10개 문서의 문서id, 제목, 동의수 컬럼만 가져오기


#문제8) 카테고리별 문서개수와 평균동의수 구한 후 평균동의수로 내림차순 정렬하기


#문제9) 카테고리별 문서당 동의개수를 구하기


#문제10) 2018년 4월에 나온 청원글의 카테고리별 문서개수 구하고 내림차순으로 정렬하기



